#Γράψτε ένα πρόγραμμα που μπορεί να ανιχνεύει υπερχειλισεις δύο προδημασμένων αριθμών που πρόκειται να προστεθούν χωρίς να χρησιμοποιούνται υπό συνθήκη άλματα
#Το bit υπερχείλισης να αποθηκεύεται σε ένα bit κάποιου καταχωρητή.


.text 
 .globl __start 
__start: 

    
   
    add $t0, $zero, $s0    # Αντιγράφουμε τον αριθμό s0 στον t0
    add $t1, $zero, $s1    # Αντιγράφουμε τον αριθμό s1 στον t1

    add $s2, $t0, $t1      # Προσθέτουμε τους αριθμούς και αποθηκεύουμε το αποτέλεσμα στον s2

    slt $t2, $t0, $zero    # Έλεγχος αν ο αριθμός t0 είναι αρνητικός
    slt $t3, $t1, $zero    # Έλεγχος αν ο αριθμός t1 είναι αρνητικός

    xor $t4, $t2, $t3      # Εφαρμογή λογικού XOR στα αποτελέσματα των προηγούμενων ελέγχων

    and $t5, $t4, $t2      # Εφαρμογή λογικού AND μεταξύ του αποτελέσματος του XOR και του t2

    sw $t5, overflow_flag  # Αποθήκευση του bit υπερχείλισης στη μνήμη

    # Εδώ μπορείτε να συνεχίσετε με οποιεσδήποτε άλλες ενέργειες θέλετε

    li $v0, 10             # Τερματισμός προγράμματος
    syscall

.data
    overflow_flag: .word 0

