.text 
 .globl __start 
__start: 

 # Διάβασμα αριθμού κινητής υποδιαστολής από την κονσόλα 
    li $v0, 6       # Ορίζει τον κώδικα για την κλήση συστήματος  read_float (6)
    syscall         # Κάνει την κλήση συστήματος 

    # Αποθήκευση του αριθμού που διαβάστηκε
    mov.s $f12, $f0 # Μεταφέρει τον αριθμό από τον καταχωρητή $f0 στον $f12

    # Εκτύπωση του αριθμού 
    li $v0, 2       # Ορίζει τον κώδικα για την κλήση του συστήματος print_float (2)
    syscall         # Κάνει την κλήση συστήματος

    # Έξοδος από το πρόγραμμα 
    li $v0, 10      # Ορίζει τον κώδικα για την κλήση συστήματος  exit (10)
    syscall         # Κάνει την κλήση συστήματος


.data
buf: .space 100    # εφεδρεία χώρου στην μνήμη για τον αριθμό που θα διαβαστεί 

