        .data
factorial:  .float 1.0

        .text
        .globl main

main:
        la $t0, factorial       # Φορτώνουμε τη διεύθυνση μνήμης του παραγοντικού στον $t0
        lwc1 $f1, 0($t0)        # Φορτώνουμε την τιμή του παραγοντικού στον $f1
        move $t1, $a0           # Φορτώνουμε την τιμή του n στον $t1
loop:
        mtc1 $t1, $f0           # Μεταφέρουμε την τιμή του $t1 (n) στον $f0
        cvt.s.w $f0, $f0        # Μετατρέπουμε τον $f0 σε float
        mul.s $f1, $f1, $f0     # Πολλαπλασιάζουμε τον $f1 (παραγοντικός) με τον $f0 (n)
        sub $t1, $t1, 1         # Μειώνουμε το n κατά 1
        bgtz $t1, loop          # Αν n > 0, επαναλαμβάνουμε την loop
        swc1 $f1, 0($t0)        # Αποθηκεύουμε την τελική τιμή του παραγοντικού στη μνήμη
        jr $ra                  # Επιστρέφουμε από τη main

