Προσθέστεδύο διανύσματα (τύπου [1.0 2.0 3.0]+ [1.0 1.0 2.0]=[2.0 3.0 5.0]) και εκτυπώστε τα. 
Τα δύο διανύσματα να δοθούν από την μνήμη (το .data). Το 3ο διάστημα που προκύπτει να το αποθηκέυουμε επίσης στην μνήμη


.text
.globl main
main:
    # Βρόχος για την προσθήκη των διανυσμάτων
    li $t0, 0                       # Αρχικοποίηση δείκτη
    li $t1, 3                       # Ορίζει το μέγεθος του διανύσματος
loop:
    beq $t0, $t1, end               # Έλεγχος αν τελειώσαμε 
    sll $t2, $t0, 2                 # Διαστήματα σε bytes

    # Προσθέτει τα δύο διανύσματα
    lwc1 $f0, vector1($t2)          # Φορτώνει την τιμή από το  vector1
    lwc1 $f1, vector2($t2)          # Φορτώνει την τιμή από το  vector2
    add.s $f2, $f0, $f1             # Προσθέτει τις τιμές
    swc1 $f2, result($t2)           # Αποθηκεύει το αποτέλεσμα

    addi $t0, $t0, 1                # Αυξάνει τον δείκτη
    j loop                          # Επαναλαμβάνει τον βρόχο
end:
    jr $ra                          #Επιστρέφει από την main





.data
vector1: .float 1.0, 2.0, 3.0
vector2: .float 1.0, 1.0, 2.0
result:  .float 0.0, 0.0, 0.0

