.data
x:    .float 1.0        # το x θα δίνεται από τον χρήστη αύτο είναι για να εισάγουμε τον αριθμό
result: .float 1.0      # αρχικοποιούμε το αποτέλεσμα 1 (γιατί 0!=1)
factorial: .float 1.0   # αρχικοποιούμε το παραγοντικό 1 (γιατί 0!=1)
k: .word 8              # θα χρησιμοποιήσουμε 8 όρους
n: .word 1              # ο αριθμητής

.text
.global main
main:
    la $t0, x           # φορτώστε τη διεύθυνση μνήμης του x
    la $t1, result      # φιορτώστε τη διεύθυνση μνήμης του αποτελέσματος
    la $t2, factorial   # φιορτώστε τη διεύθυνση μνήμης του παραγοντικού
    la $t3, k           # φιορτώστε τη διεύθυνση μνήμης του k
    lw $t4, 0($t3)      # φορτώστς την τιμή του  k στο $t4

loop:
    beq $t4, $zero, end # αν k == 0, τότς τερματίστε το  loop
    l.s $f0, 0($t0)     # φορτώστε την τιμή του x
    l.s $f1, 0($t1)     #  φορτώστε την τιμή του αποτελέσματος
    l.s $f2, 0($t2)     #  φορτώστε την τιμή του παραγοντικού 

    mul.s $f3, $f0, $f1 # x^n
    div.s $f4, $f3, $f2 # x^n / n!
    add.s $f1, $f1, $f4 # Στοιχείο σειράς

    addi $t4, $t4, -1   # μείωση του k
    s.s $f1, 0($t1)     # αποθήκευση του νέου αποτελέσματος
    mul.s $f2, $f2, $f0 # n! = n! * x
    s.s $f2, 0($t2)     # αποθήκευση του νέου παραγοντικού 
    j loop               #επαναλάβετε loop

end:

